a = "Hello"
b = "Python"

print("a: ", a)
print("b: ", b)

print("a + b 输出结果：", a + b)     # +: 字符串连接
print("a * 2 输出结果：", a * 2)     # *: 重复输出字符串
print("a[1] 输出结果：", a[1])       # []: 通过索引获取字符串中字符
print("a[1:4] 输出结果：", a[1:4])   # [:]: 截取字符串中的一部分，遵循左闭右开原则，str[0:2] 是不包含第 3 个字符的。

if( "H" in a) :                      # in: 成员运算符 - 如果字符串中包含给定的字符返回 True
    print("H 在变量 a 中")
else :
    print("H 不在变量 a 中")

if( "M" not in a) :                  # not in: 成员运算符 - 如果字符串中不包含给定的字符返回 True
    print("M 不在变量 a 中")
else :
    print("M 在变量 a 中")

print (r'\n')                        # r/R: 原始字符串 - 原始字符串：所有的字符串都是直接按照字面的意思来使用
                                     # 没有转义特殊或不能打印的字符。
                                     # 原始字符串除在字符串的第一个引号前加上字母 r（可以大小写）以外
                                     # 与普通字符串有着几乎完全相同的语法。
print (R'\n')
